package polyphone

import (
	"strings"
)

var singleLetters = [17][2]string{
	{"Е", "А"},
	{"Ё", "А"},
	{"И", "А"},
	{"О", "А"},
	{"Ы", "А"},
	{"Э", "А"},
	{"Я", "А"},
	{"Б", "П"},
	{"Б", "П"},
	{"В", "Ф"},
	{"Г", "К"},
	{"Д", "Т"},
	{"З", "С"},
	{"Щ", "Ш"},
	{"Ж", "Ш"},
	{"М", "Н"},
	{"Ю", "У"},
}

var multiLetter = [31][2]string{
	{"АКА", "АФА"},
	{"АН", "Н"},
	{"ЗЧ", "Ш"},
	{"ЛФСТФ", "ЛСТФ"},
	{"НАТ", "Н"},
	{"НТЦ", "НЦ"},
	{"НТ", "Н"},
	{"НТА", "НА"},
	{"НТК", "НК"},
	{"НТС", "НС"},
	{"НТСК", "НСК"},
	{"НТШ", "НШ"},
	{"ОКО", "ОФО"},
	{"ПАЛ", "ПЛ"},
	{"РТЧ", "РЧ"},
	{"РТЦ", "РЦ"},
	{"СП", "СФ"},
	{"ТСЯ", "Ц"},
	{"СТЛ", "СЛ"},
	{"СТН", "СН"},
	{"СЧ", "Ш"},
	{"СШ", "Ш"},
	{"ТАТ", "Т"},
	{"ТСА", "Ц"},
	{"ТАФ", "ТФ"},
	{"ТС", "ТЦ"},
	{"ТЦ", "Ц"},
	{"ТЧ", "Ч"},
	{"ФАК", "ФК"},
	{"ФСТФ", "СТФ"},
	{"ШЧ", "Ш"},
}

func replaces(s string) string {
	for _, v := range singleLetters {
		s = strings.Replace(s, v[0], v[1], -1)
	}

	for _, v := range multiLetter {
		s = strings.Replace(s, v[0], v[1], -1)
	}

	return s
}
